# Introduction

In this project, I tried to assist a manpower agency to identify which country is best fit for a specific client based on client specifications. I also wanted to give a business solution to increase their profits by showing them the countries that best return the highest profit.

First, I acquired a row and dirty data from the agency office that has been collected between the years 2014 and 2015. The first data came in three excel files and it was all associated with the countries Bangladesh, Philippines, and Sri Lanka. The data did not look like an easy and clean data to work with, which results in spending hours and hours of preprocessing which includes cleaning, extracting features, etc. Then, I combined all of the three datasets into one, so that I can perform some modelling and visualizations. I used this combined data to perform classification modelling which means that I wanted to predict the probability that a country would be the best choice for a client based on his/her specification. I also perform clustering modelling so that I can study the behaviour of clients. In the end, I ended up with a good accuracy model that predicts the probability of the best country that the client would like based on his/her specifications.

Second, I spent a lot of time looking for different datasets on the agency online system, so that it would support my modelling process or help me to come up with another solution based on the first prediction. I found a really useful data that shows the price of recruitment, cost of the supplier, and the profit. Thus, I used this data to show the profit among countries after I predict the country in the first part so that the agency can use the model and the data analysis to the benefit of the business. In conclusion, service providers can benefit a lot from the model and the data analysis.

Third, I broke my project process into three files. dirty_data where I got my data as a raw data and then I cleaned it. In the second file 'clean_data', I performed data visualization and drumming my data to prepare it for modelling. In this file, I performed a classification and clustering models. I the third file named 'profits_file', I visualized data after cleaning so that we can use them in the prediction file 'clean_data'.

To sum up, I believed that I did good work achieving a better accuracy in my classification model that would be beneficial for the business. I also believed that my data analysis and visualizations would assist the employer to make better decisions. For future work, I am planning to work hand to hand with my uncle to build a system that collects data properly so that we can make better-looking visualization which would result in making better business decisions

### **WE READ THREE DIFFERENT FILES FOR PREPROCCESING**

# Import libraries

In [104]:
# import libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import re
import hashlib
from pandas.util import hash_pandas_object

# Load in the data

In [105]:
# load in the data
bangladesh = pd.read_excel('datasets/Bangladesh_data.xlsx', header=None)
philippines = pd.read_excel('datasets/Philippines_data.xlsx', header=None)
sri_lanka = pd.read_excel('datasets/Sri_Lanka_data.xlsx', header=None)

# Preprocessing the data
    This preproccing would include different steps.
    Step1: removing null values in the data
    Step2: renaming columns for ease of use
    Step3: extracting features from the existing columns

**We'll seprate our preproccessing into three since we have three different datasets 'Bangladesh data, Philippines data, Sri Lanka data'**

In [106]:
# check the shape of the data
bangladesh.shape, philippines.shape, sri_lanka.shape

((684, 20), (628, 20), (607, 18))

# 1) cleaning Bangladesh data

In [107]:
# print the head of the data
bangladesh.head(8)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,مكتب الاختيار للاستقدام (معاملات بنجلاديش),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,الرقم,الاسم,رقم التأشيره,رقم السجل,تاريخ الميلاد,العنوان - رقم الهاتف,المواصفات,تاريخ التقديم,المكتب,الحالة,اسم الخادمة,تاريخ التفييذ,تاريخ الوصول,ملاحظات,NaN,NaN,NaN,NaN,NaN
4,NaN,1,خالد محمد جمعان المالكي,1800025194,1054846645,NaN,الرياض - حي العريجاء هاتف 0544863487,مقبولة الشكل العمر من 25 الى 35,2016-04-01 00:00:00,D,تم الوصول,NaN,NaN,NaN,تم تسديد كامل المبلغ,NaN,NaN,NaN,NaN,NaN
5,NaN,2,حجي عسوج الشمري,1104303794,1034719789,NaN,الرياض - حي النسيم هاتف 0566266617,مقبولة الشكل العمر من 25 الى 35,2016-04-01 00:00:00,D,تم الوصول,NaN,NaN,NaN,تم تسديد كامل المبلغ,NaN,NaN,NaN,NaN,NaN
6,NaN,3,مسعود فرج العتيبي,1104304960,1002211058,NaN,الرياض-حي السعاده 0555419630,مقبولة الشكل العمر من 25 الى 35,2016-04-01 00:00:00,D,تم الوصول,NaN,NaN,NaN,NaN,NaN,NaN,NaN,D,تم التفييز
7,NaN,4,ماجد عبود القحطاني,1104298913,1016030874,NaN,الرياض-حي الرمال هاتف 0506865754,مقبولة الشكل العمر من 25 الى 35,2016-04-01 00:00:00,A,تم الوصول,NaN,NaN,2017-01-06 00:00:00,تم تسديد 12000,NaN,NaN,NaN,A,تم الحجز

In [108]:
# drop the first three rows since that they have no values
bangladesh.drop(bangladesh.index[:3], inplace=True)

In [109]:
# set the first row to be our columns names
bangladesh.rename(columns=bangladesh.iloc[0], inplace=True)

In [110]:
# drop the first row which is a duplicate of our columns names
bangladesh.drop(bangladesh.index[:1], inplace=True)

In [111]:
# reassign the data after droping some unuseful columns
bangladesh = bangladesh.iloc[:, 2:-5]

In [112]:
# reset index
bangladesh.reset_index(inplace=True, drop=True)

In [113]:
# print the head od the dataframe
bangladesh.head()

,الاسم,رقم التأشيره,رقم السجل,تاريخ الميلاد,العنوان - رقم الهاتف,المواصفات,تاريخ التقديم,المكتب,الحالة,اسم الخادمة,تاريخ التفييذ,تاريخ الوصول,ملاحظات
0,خالد محمد جمعان المالكي,1800025194,1054846645,NaN,الرياض - حي العريجاء هاتف 0544863487,مقبولة الشكل العمر من 25 الى 35,2016-04-01 00:00:00,D,تم الوصول,NaN,NaN,NaN,تم تسديد كامل المبلغ
1,حجي عسوج الشمري,1104303794,1034719789,NaN,الرياض - حي النسيم هاتف 0566266617,مقبولة الشكل العمر من 25 الى 35,2016-04-01 00:00:00,D,تم الوصول,NaN,NaN,NaN,تم تسديد كامل المبلغ
2,مسعود فرج العتيبي,1104304960,1002211058,NaN,الرياض-حي السعاده 0555419630,مقبولة الشكل العمر من 25 الى 35,2016-04-01 00:00:00,D,تم الوصول,NaN,NaN,NaN,NaN
3,ماجد عبود القحطاني,1104298913,1016030874,NaN,الرياض-حي الرمال هاتف 0506865754,مقبولة الشكل العمر من 25 الى 35,2016-04-01 00:00:00,A,تم الوصول,NaN,NaN,2017-01-06 00:00:00,تم تسديد 12000
4,عبدالرحمن عبود القحطاني,3100056928,1016030833,NaN,الرياض-حي الرمال هاتف 0506865754,مقبولة الشكل العمر من 25 الى 35,2016-04-01 00:00:00,D,تم الوصول,NaN,NaN,NaN,تم تسديد كامل المبلغ

In [114]:
# rename columns
columns_translated = {'الاسم': 'name', 'رقم التأشيره': 'visa_number', 'رقم السجل': 'id', 'تاريخ الميلاد': 'date_of_birth',
                   'العنوان - رقم الهاتف': 'address_phone_number', 'المواصفات': 'specifications', 'تاريخ التقديم': 'date_of_submission',
                   'المكتب': 'office', 'الحالة': 'condition', 'اسم الخادمة': 'maid_name', 'تاريخ التفييذ': 'Date_of_implementation',
                   'تاريخ الوصول': 'arrival_date', 'ملاحظات': 'note'
                  }

In [115]:
# translate the columns from Arabic to English
bangladesh.rename(columns=columns_translated, inplace=True)

In [116]:
# check the column names
bangladesh.columns

Index(['name', 'visa_number', 'id', 'date_of_birth', 'address_phone_number',
       'specifications', 'date_of_submission', 'office', 'condition',
       'maid_name', 'Date_of_implementation', 'arrival_date', 'note'],
      dtype='object')

In [117]:
# check the null values per column
bangladesh.isnull().sum()

name                        2
visa_number                 3
id                          2
date_of_birth             520
address_phone_number       50
specifications             44
date_of_submission         17
office                     44
condition                  42
maid_name                 545
Date_of_implementation    546
arrival_date              336
note                       40
dtype: int64

In [118]:
# drop columns when null values are a lot
bangladesh.drop(columns=['date_of_birth', 'date_of_submission', 'maid_name', 'Date_of_implementation', 'arrival_date', 'note', 'condition'], inplace=True)

In [119]:
# print the head od the dataframe after doing some cleaning
bangladesh.head(8)

,name,visa_number,id,address_phone_number,specifications,office
0,خالد محمد جمعان المالكي,1800025194,1054846645,الرياض - حي العريجاء هاتف 0544863487,مقبولة الشكل العمر من 25 الى 35,D
1,حجي عسوج الشمري,1104303794,1034719789,الرياض - حي النسيم هاتف 0566266617,مقبولة الشكل العمر من 25 الى 35,D
2,مسعود فرج العتيبي,1104304960,1002211058,الرياض-حي السعاده 0555419630,مقبولة الشكل العمر من 25 الى 35,D
3,ماجد عبود القحطاني,1104298913,1016030874,الرياض-حي الرمال هاتف 0506865754,مقبولة الشكل العمر من 25 الى 35,A
4,عبدالرحمن عبود القحطاني,3100056928,1016030833,الرياض-حي الرمال هاتف 0506865754,مقبولة الشكل العمر من 25 الى 35,D
5,عبدالله علي الشهري,3100056880,1004780639,تبوك-المدينه العسكريه هاتف 0555380006,مقبولة الشكل العمر من 25 الى 35,D
6,فاطمه جروان محمد علي,1104300022,1050150869,الرياض البديعه شارع ابن الجوزي هاتف 0549444778...,مسلمه - مقبولة الشكل - رعاية الأطفال بسبب العمل,D
7,فاطمه سعيد علي القحطاني,5100166187,1095703334,أبها - حي النسيم بجوار مستشفى الولاده هاتف 054...,مقبولة الشكل العمر من 25 الى 35,D

In [120]:
# drop row if all values are null
bangladesh.dropna(how='all', inplace=True)

In [121]:
# check the shape of the data after doing some cleaning
bangladesh.shape

(678, 6)

In [122]:
# could hash the dataframe columns
# bangladesh.name = hash_pandas_object(bangladesh.name)
# bangladesh.head()

## **In the following cells, we'll do feature engineering**

# extract phone number

In [123]:
# get the digit out of the address_phone_number column
bangladesh_phone_number = bangladesh.address_phone_number.str.findall(r'\d+')

# function to extract list of items into string separated by comma
def extract_phone_number(x):
    # try clause in case something unexpected happens 
    try :
        # check the length of the item in the list, all phone numbers are 10 digits
        # so if the item is less that that, then don't include it in the new string
        for item in x:
            # phone number here in Saudi are 10 digits, so if the length of the digits is less than 5, then return nan
            if len(item) < 5:
                return np.nan
        # and if the cell is not empty cell, we'll return the value
        if x != []:
            return ",".join(x)
        # else, return nan, means none of the condition is met
        else:
            return np.nan
    # if something unexpected happens, return nan
    except:
        return np.nan
    
# create a new column of phone number
bangladesh['phone_number'] = bangladesh_phone_number.apply(extract_phone_number)

# extract city from bangladesh data

In [124]:
# extract city from the address_phone_number column
def extract_city_bangladesh(value):
    # instantiate an empty list
    city = []
    # always have a try except bluck in case something out of control happens
    try:
        # loop through the cell separating it by space
        for i in value.split(' '):
            # assign the first string which supposed to be a city to a variable named the city
            the_city = value.split(' ')[0]
            # in case the city is not in the expected location, we want to check if the string is not digit, then we'll append it to the list
            # that we'll return at the end
            if the_city.isdigit() != True:
                # append the string 'city' to the list
                city.append(the_city.split('-')[0])
            break
        # join all city together and separate them by comma    
        city = ",".join(city)
    # if unexpected thing happend, return nan
    except:
         return np.nan
    # return the city list which contains all city
    return city
# create a new column for city that we extracted from the address_phone_number column
bangladesh['city'] = bangladesh['address_phone_number'].apply(extract_city_bangladesh)

# extract neighbor bangladesh

In [125]:
# extract neighbor from the address_phone_number column
def extract_neighbor_bangladesh(value):
    # unwanted words that I found within the whole columns
    unwanted_words = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', 'بديله', 'لم', 'راشد', 'هاتف', '.', '\n']
    # instantiate an empty list
    neighbor = []
    # always have a try except bluck in case something out of control happens
    try:
        # loop through cell passing the first index since it will always have the city
        for i in value.split(' ')[1:]:
                # since every neighbor starts with two unique letters, I set them in an if-statement
            if i.strip().isdigit() == False and i != '-' and len(i) > 2 and i not in unwanted_words and re.findall('^\w',i):
                # append the neighbor to the neighbor list
                neighbor.append(i)
                break
        # make the list as one string splitting it b comma        
        neighbor = ",".join(neighbor)
    # if something unexpected happens, then return nan
    except:
         return np.nan
    # return the neighbor list so that we can create a new column in our dataframe
    return neighbor
# Create a new column of neighbors
bangladesh['neighbor'] = bangladesh['address_phone_number'].apply(extract_neighbor_bangladesh)

# since I discovered that neighbors have inconsistent string, I do another extraction to extract the accurate ones
new_neighbor_list = []
# iterate through the neighbor column
for i in bangladesh['neighbor']:
# within the try block, check if the neighbor starts with two specific character which all neighbors in saudi starts with
    try:
        if "ال" in i or len(i) > 4:
            # if the string starts with the two specified character, then append it to the new list
            new_neighbor_list.append(i)
    # if not, then append nan which means no neighbor was founded
    except:
        new_neighbor_list.append(np.nan)

# convert the new neighbor list to a pandas series so that we can assign it to the neighbor column
bangladesh['neighbor'] = pd.Series(new_neighbor_list)

# Use Python vectorization technique to extract some features

In [126]:
# splitting the specifications column into multiple columns with values 0s and 1s, 
# and then create another columns when two related columns have the value False

# method to pass in a word and a cell and returns True False values if the string exists in the specified cell
def word_in_col(word, x):
    try : 
        # return True if the string is in the cell
        return word in x
    except:
        # return False if the string is not in the cell
        return False

    
# extract appearance with True and False values. True if the client specified appearance in the request form    
bangladesh['appearance'] = bangladesh.specifications.str.contains('حسنة المظهر', 'مقبولة الشكل').astype(bool)

# extract experience with True and False values. True if the client specified that the maid has experience in the request form    
bangladesh['have_wokred'] = bangladesh.specifications.str.contains('سبق لها').astype(bool)

# extract experience with True and False values. True if the client specified that the maid has no experience in the request form    
bangladesh['no_experience'] = bangladesh.specifications.str.contains('جديدة', 'يسبق').astype(bool)

# extract experience with True and False values. True if the client did not specified that the maid has nor does not have experience in the request form    
bangladesh['experience_not_specified'] = (~bangladesh['no_experience']) & (~bangladesh['have_wokred'])

# extract good with kids with True and False values. True if the client did not specified that the maid is okay with dealing with kids in the request form    
bangladesh['good_with_kids'] = bangladesh.specifications.str.contains('أطفال').astype(bool)

# extract good with elderly with True and False values. True if the client did not specified that the maid is okay with dealing with elderly in the request form
bangladesh['good_with_elderly'] = bangladesh.specifications.str.contains('رعاية', 'السن').astype(bool)


# making two masks with True and False values.
# in the first mask, we specified that we want the value to be True if the word muslim is in the cell
mask_muslim = bangladesh.specifications.apply(lambda x: word_in_col("مسلم", x))

# in the second mask, we specified that we want the value to be True if the word not-muslim is in the cell
mask_not_muslim = bangladesh.specifications.apply(lambda x: word_in_col("غير مسلم", x))

# create a column named muslim if the mask is True when we specified that muslim return True
bangladesh['muslim'] = (mask_muslim & ~mask_not_muslim)

# create a column named not_muslim if the mask is True when we specified that not-muslim return True
bangladesh['not_muslim'] =  mask_not_muslim

# create a column named religion not specified if the mask is not True when we did not specified that religion
bangladesh['religion_not_specified'] =  ~mask_muslim 

# making two masks with True and False values.
# in the first mask, we specified that we want the value to be True if the word marrid is in the cell
mask_marrid = bangladesh.specifications.apply(lambda x: word_in_col("متزوج", x))

# in the second mask, we specified that we want the value to be True if the word marrid is in the cell
mask_not_marrid = bangladesh.specifications.apply(lambda x: word_in_col("غير متزوج", x))

# create a column named marrid if the mask is True when we specified that marrid return True
bangladesh['marrid'] = (mask_marrid & ~mask_not_marrid)

# create a column named not_marrid if the mask is True when we specified that not-marrid return True
bangladesh['not_marrid'] =  mask_not_marrid

# create a column named status not specified if the mask is not True when we did not specified that status
bangladesh['status_not_specified'] =  ~mask_marrid

**check specifications column and replace every occurrence of the word  الى |  من which corresponds to 'from' and 'to' we'll convert every occurrence of these two to - 'dash' so that we can extract the age range easily**

In [127]:
# instantiate a new list of specifications with the age being in the right way  
new_specifications = []

# iterate through each row of the specifications
for i in bangladesh.specifications.values:
    # always have a try block, to check if the given string does exist in the cell
    try:
        # whenever you find the specified character, replace it with dash and append it to the list
        if 'الى' in i:
            new_specifications.append(i.replace('الى','-'))
        # whenever you find the specified character, replace it with dash and append it to the list
        elif 'من' in i:
            new_specifications.append(i.replace('من', '-'))
        # if we don't find the specified character, then we'll append the character the wasy it is
        else:
            new_specifications.append(i)
    # if something unexpected happens, then return the cell as it is
    except:
        new_specifications.append(i)

# replace the specifications column values with the new vlaues after converting the new list to a pandas series
bangladesh.specifications = pd.Series(new_specifications)

# extract age range from bangladesh data

In [128]:
# extract age range from the specifications column
def extract_age_range_bangladesh(value):
    
    """
    now since we did some cleaning to the specification column so that it can help us extract the age range easily,
    we'll extract the age range
    """
    
    # instantiate a new age range list
    age_range = []
    # always have a try block 
    try:
        # split the cell by space 
        for i in value.split(' '):
            # check if the string is digit, which means it is an age
            if i.isdigit() == True:
                # if you find two age ranges, then append them to the list
                age_range.append(i)
        # split the age ranges by a dash symbol 
        age_range = "-".join(age_range)
    # if something unexpected happens, then return a nan
    except:
         return np.nan
    # return the age ranges list
    return age_range

# create a new column which would contains the age ranges that we extracted from the specification columns
bangladesh['age_range'] = bangladesh['specifications'].apply(extract_age_range_bangladesh)

# extract family name bangladesh

In [129]:
def extract_family_name_bangladesh(value):
    """
    since we have a name column, we'll extract the last name which is the family name.
    """
    # try block in case something unexpected happens
    try:
        # check if the last string in the cell is not a digit
        if value.split(' ')[-1] != '' and value.split(' ')[-1].isdigit() != True:
            # if the condition is true, then we'll return the string
            return value.split(' ')[-1]
        # else, we'll check the same condition with the two to the last string 
        elif value.split(' ')[-2].isdigit() != True:
            # if the condition is true, then we'll return the string
            return value.split(' ')[-2]
        # if the condition is not met, then we'll return nan
        else:
            return np.nan
    # if something unexpected happens, then we'll return nan
    except:
        return np.nan
# create a new column with the family name extracted fromt the name column
bangladesh['family_name'] = bangladesh['name'].apply(extract_family_name_bangladesh)

In [130]:
# print the data after creating new columns
bangladesh.dtypes

name                        object
visa_number                 object
id                          object
address_phone_number        object
specifications              object
office                      object
phone_number                object
city                        object
neighbor                    object
appearance                    bool
have_wokred                   bool
no_experience                 bool
experience_not_specified      bool
good_with_kids                bool
good_with_elderly             bool
muslim                        bool
not_muslim                    bool
religion_not_specified        bool
marrid                        bool
not_marrid                    bool
status_not_specified          bool
age_range                   object
family_name                 object
dtype: object

In [131]:
# drop the original columns
bangladesh.drop(['name', 'address_phone_number', 'specifications', 'phone_number', 'neighbor'], axis=1, inplace=True)

In [132]:
# check the shape of the data
bangladesh.shape

(678, 18)

In [133]:
# drop rows if all columns are null
bangladesh.dropna(how='all', inplace=True)

In [134]:
# check the shape of the data after dropping null rows
bangladesh.shape

(678, 18)

In [135]:
# print the final version of our data
bangladesh.head()

,visa_number,id,office,city,appearance,have_wokred,no_experience,experience_not_specified,good_with_kids,good_with_elderly,muslim,not_muslim,religion_not_specified,marrid,not_marrid,status_not_specified,age_range,family_name
0,1800025194,1054846645,D,الرياض,False,False,False,True,False,False,False,False,True,False,False,True,25-35,المالكي
1,1104303794,1034719789,D,الرياض,False,False,False,True,False,False,False,False,True,False,False,True,25-35,الشمري
2,1104304960,1002211058,D,الرياض,False,False,False,True,False,False,False,False,True,False,False,True,25-35,العتيبي
3,1104298913,1016030874,A,الرياض,False,False,False,True,False,False,False,False,True,False,False,True,25-35,القحطاني
4,3100056928,1016030833,D,الرياض,False,False,False,True,False,False,False,False,True,False,False,True,25-35,القحطاني

In [136]:
# check the null values
bangladesh.isnull().sum()

visa_number                  1
id                           0
office                      42
city                        56
appearance                   0
have_wokred                  0
no_experience                0
experience_not_specified     0
good_with_kids               0
good_with_elderly            0
muslim                       0
not_muslim                   0
religion_not_specified       0
marrid                       0
not_marrid                   0
status_not_specified         0
age_range                   42
family_name                  3
dtype: int64

### - The first part of preprocessing in the bangladesh data is done. Now we'll make sure that we replace any dirty value with the the value other values.

In [137]:
# bangladesh.visa_number.isnull().sum()
bangladesh.visa_number.fillna(0, inplace=True)

In [138]:
bangladesh.office.value_counts()
# I replace the null values with the most frequent office 'class'
bangladesh.office.fillna('office_not_specified', inplace=True)

In [139]:
bangladesh.city.value_counts()
# I replace the null values with the most frequent office 'class'
bangladesh.city.fillna('city_not_specified', inplace=True)

## I think that neighbor would not be useful for our model since most rows have no values for neighbor

In [140]:
# bangladesh.neighbor.value_counts()

## clean the extracted features

In [141]:
# replacing age_rnges that have fewer values with the most frequent age_range 'class'
# instantiate a new age ranges list
new_age_range = []
# iterate through the age ranges list
for i in bangladesh.age_range:
    # these the most frequent classes by ascending order
    # if you face these ages ranges, then append them as the way they are
    if i == '25-35' or i == '30-35' or i == '25-30' or i == '30-40' or i == '35-40':
        new_age_range.append(i)
    # if you find any other age ranges, then append the string 'age_not_specified'
    else:
        new_age_range.append('age_not_specified')
# replace the age ranges column with the new cleaned list after is is converted to a pandas list
bangladesh.age_range = pd.Series(new_age_range)
# check the value counts after our final cleaning
# bangladesh.age_range.value_counts()

In [142]:
# make two masks: 1st: for family name that occurs less than 6 times. 2nd: strange family name
mask_family_name_less_than_six = bangladesh.family_name.value_counts()[bangladesh.family_name.value_counts() < 6]
mask_strange_family_name = ['عبدالله', 'المعامله', 'شاكر', 'فيصل']

# apply our two masks
bangladesh.family_name = bangladesh.family_name.apply(lambda x: 'family_not_specified' if x in mask_family_name_less_than_six or x in mask_strange_family_name else x)

# check the value counts after our final cleaning
# bangladesh.family_name.value_counts()

In [143]:
# use loc to check replace the null values in the specified column
bangladesh.loc[bangladesh.family_name.isnull(),"family_name"] = 'family_not_specified'

In [144]:
# finally we have no null values
bangladesh.isnull().sum()

visa_number                 0
id                          0
office                      0
city                        0
appearance                  0
have_wokred                 0
no_experience               0
experience_not_specified    0
good_with_kids              0
good_with_elderly           0
muslim                      0
not_muslim                  0
religion_not_specified      0
marrid                      0
not_marrid                  0
status_not_specified        0
age_range                   0
family_name                 0
dtype: int64

In [145]:
# print the head of the dataframe after it's cleaned
bangladesh.head()

,visa_number,id,office,city,appearance,have_wokred,no_experience,experience_not_specified,good_with_kids,good_with_elderly,muslim,not_muslim,religion_not_specified,marrid,not_marrid,status_not_specified,age_range,family_name
0,1800025194,1054846645,D,الرياض,False,False,False,True,False,False,False,False,True,False,False,True,25-35,family_not_specified
1,1104303794,1034719789,D,الرياض,False,False,False,True,False,False,False,False,True,False,False,True,25-35,الشمري
2,1104304960,1002211058,D,الرياض,False,False,False,True,False,False,False,False,True,False,False,True,25-35,العتيبي
3,1104298913,1016030874,A,الرياض,False,False,False,True,False,False,False,False,True,False,False,True,25-35,القحطاني
4,3100056928,1016030833,D,الرياض,False,False,False,True,False,False,False,False,True,False,False,True,25-35,القحطاني

In [146]:
list(bangladesh.columns)

['visa_number',
 'id',
 'office',
 'city',
 'appearance',
 'have_wokred',
 'no_experience',
 'experience_not_specified',
 'good_with_kids',
 'good_with_elderly',
 'muslim',
 'not_muslim',
 'religion_not_specified',
 'marrid',
 'not_marrid',
 'status_not_specified',
 'age_range',
 'family_name']

# 2) cleaning Philippines data

In [147]:
# print the head of the data
philippines.head(2)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,متابعة معاملات دولة الفلبين,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [148]:
# drop the first three rows since that they have no values
philippines.drop(bangladesh.index[:3], inplace=True)

In [149]:
# set the first row to be our columns names
philippines.rename(columns=philippines.iloc[0], inplace=True)

In [150]:
# drop the first row which is a duplicate of our columns names
philippines.drop(philippines.index[:1], inplace=True)

In [151]:
# reassign the data after droping some unuseful columns
philippines = philippines.iloc[:, 2:-5]

In [152]:
# reset index
philippines.reset_index(inplace=True, drop=True)

In [153]:
# since mostl rows at the end are null, I am going to reassign the dataframe with the none_null values one
philippines = philippines.iloc[:222]

In [154]:
# rename columns
columns_translated = {'الاسم': 'name', 'رقم التأشيره': 'visa_number', 'رقم السجل': 'id', 'العنوان ': 'address',
                   'الهاتف': 'phone_number', 'المواصفات': 'specifications', 'تاريخ التقديم': 'date_of_submission',
                   'المكتب': 'office', 'الحالة': 'condition', 'تاريخ الوصول': 'arrival_date', 'المبلغ المدفوع': 'payed_amount',
                   'المبلغ المتبقي': 'remaining_amount', 'ملاحظات': 'note'
                  }

In [155]:
# translate the columns from Arabic to English
philippines.rename(columns=columns_translated, inplace=True)

In [156]:
# check the column names
philippines.columns

Index(['name', 'visa_number', 'id', 'address', 'phone_number',
       'specifications', 'date_of_submission', 'office', 'condition',
       'arrival_date', 'payed_amount', 'remaining_amount', 'note'],
      dtype='object')

In [157]:
# check the null values per column
philippines.isnull().sum()

name                   0
visa_number            0
id                     0
address                6
phone_number          19
specifications        19
date_of_submission    18
office                18
condition             25
arrival_date          36
payed_amount          68
remaining_amount       1
note                  51
dtype: int64

In [158]:
# drop columns when null values are a lot
philippines.drop(columns=['date_of_submission', 'arrival_date', 'payed_amount', 'remaining_amount', 'note'], inplace=True)

In [159]:
# print the data after dropping unuseful columns
philippines.head()

,name,visa_number,id,address,phone_number,specifications,office,condition
0,مسعود مقيت محمد الشبوي,1104381620,1013904816,الرياض - حي السويدي - شارع اسحق بن عبدالرحمن -...,NaN,جديدة/ عمر(30-38)/ مهم مسلمة - تجيد معاملة الأ...,PH,تم الوصول
1,مسعد سرحان عبدالله الخالدي,1104373638,1033166263,الرياض-حي الياسمين - شارع الفرعة - منزل 9/ب / ...,NaN,خبيرة- عمر (30-40) - معاملة أطفال (3),PH,تم الوصول
2,مريحه سالم ال دغيش اليامي,5200101517,1025375773,الجنوب نجران - بدر الجنوب - شارع انيزة/ 056060...,NaN,عمر (35-40) رعاية ومعاملة طيبة كبار السن/ متعلمة,PH,تم الوصول
3,كادي محمد بن مقعد العتيبي,1104218534,1110896246,الرياض - الخرج - حي البدع - الشارع العام/ 0555...,555101919 - 0568656050,جديدة/ العمر(30-35) تجيد معاملة الأطفال,PH,تم الوصول
4,علي محمد صالح الشمراني,3100050964,1023827015,تبوك,NaN,معينة - 0556447959,PH,تم الوصول

# extract phone number from philippines data

In [160]:
# get the digit out of the address_phone_number column
philippines_phone_number = philippines.address.str.findall(r'\d+')

philippines['phone_number'] = philippines_phone_number.apply(extract_phone_number)

### **NOTE: There is not a lot of phone number to extract, so we might consider to drop this column afterword.

# extract city from philippines data

In [161]:
def extract_city(value):

    """
    extract the city form the address column
    """
    # instantiate a list named city to append
    city = []
    # try clause in case something unexpected happens
    try:
        # iterate through the cell separating by space
        for i in value.split(' '):
            # if the string is not digit and it's a string, then the condition is met
            if i.isdigit() != True and isinstance(i, str) == True:
                # now make a new variable with the first string in the cell which contains multiple strings in ones
                the_city = value.split(' ')[0]
                # append the last string in the variable above which is the city
                city.append(the_city.split('-')[0])
                break
        # split the list by comma
        city = ",".join(city)
    # if something unexpected happens, then we'll return nan
    except:
         return np.nan
    # return the city list
    return city
# convert the city list to a pandas series then assign it to a new column named city
philippines['city'] = philippines['address'].apply(extract_city)

# extract neighbor philippines data

In [162]:
def extract_neighbor_philippines(value):
    """
    extract neighbor from the address_phone_number column
    """
    # instantiate a list
    neighbor = []
    # try clause in case something happens
    try:
        # neighbor alwasy located in the second index of the address column
        # so we'll append in the second index to our neighbor list
        neighbor.append(value.split('-')[1])
        # separate strings in the list by comma
        neighbor = ",".join(neighbor)
    # in case something unexpected happens, then we'll return nan
    except:
         return np.nan
    # return the neighbor list
    return neighbor
# create a new column named neighbor 
philippines['neighbor'] = philippines['address'].apply(extract_neighbor_philippines)

# Use Python vectorization technique to extract some features

In [163]:
# splitting the specifications column into multiple columns with values 0s and 1s, 
# and then create another columns when two related columns have the value False

# extract appearance with True and False values. True if the client specified appearance in the request form    
philippines['appearance'] = philippines.specifications.str.contains('حسنة المظهر', 'مقبولة الشكل').astype(bool)
# extract experience with True and False values. True if the client specified that the maid has experience in the request form 
philippines['have_wokred'] = philippines.specifications.str.contains('سبق لها').astype(bool)
# extract experience with True and False values. True if the client specified that the maid has no experience in the request form 
philippines['no_experience'] = philippines.specifications.str.contains('جديدة', 'يسبق').astype(bool)
# extract experience with True and False values. True if the client did not specified that the maid has nor does not have experience in the request form    
philippines['experience_not_specified'] = (~philippines['no_experience']) & (~philippines['have_wokred'])
# extract good with kids with True and False values. True if the client did not specified that the maid is okay with dealing with kids in the request form  
philippines['good_with_kids'] = philippines.specifications.str.contains('أطفال').astype(bool)
# extract good with elderly with True and False values. True if the client did not specified that the maid is okay with dealing with elderly in the request form
philippines['good_with_elderly'] = philippines.specifications.str.contains('رعاية', 'السن').astype(bool)

# making two masks with True and False values.
# in the first mask, we specified that we want the value to be True if the word muslim is in the cell
mask_muslim = philippines.specifications.apply(lambda x: word_in_col("مسلم", x))
# in the second mask, we specified that we want the value to be True if the word not-muslim is in the cell
mask_not_muslim = philippines.specifications.apply(lambda x: word_in_col("غير مسلم", x))
# create a column named muslim if the mask is True when we specified that muslim return True
philippines['muslim'] = (mask_muslim & ~mask_not_muslim)
# create a column named not_muslim if the mask is True when we specified that not-muslim return True
philippines['not_muslim'] =  mask_not_muslim
# create a column named religion not specified if the mask is not True when we did not specified that religion
philippines['religion_not_specified'] =  ~mask_muslim 

# making two masks with True and False values.
# in the first mask, we specified that we want the value to be True if the word marrid is in the cell
mask_marrid = philippines.specifications.apply(lambda x: word_in_col("متزوج", x))
# in the second mask, we specified that we want the value to be True if the word marrid is in the cell
mask_not_marrid = philippines.specifications.apply(lambda x: word_in_col("غير متزوج", x))
# create a column named marrid if the mask is True when we specified that marrid return True
philippines['marrid'] = (mask_marrid & ~mask_not_marrid)
# create a column named not_marrid if the mask is True when we specified that not-marrid return True
philippines['not_marrid'] =  mask_not_marrid
# create a column named status not specified if the mask is not True when we did not specified that status
philippines['status_not_specified'] =  ~mask_marrid

# extract age ranges from philippines data

In [164]:
# extract age range from the specifications column
def extract_age_range(value):
    # instantiate an age range list
    age_range = []
    # try clause in case something unexpected happens
    try:
        # use regular expression to find digits
        if re.search('\d+', value) != []:
            # assign the first part of the digit to a variable named age_a
            age_a = re.findall('\d+', value)[0]
            # assign the second part of the digit to a variable named age_b
            age_b = re.findall('\d+', value)[1]
            # merge the tow parts into one serparated  by dash symbol
            age = age_a + '-' + age_b
            # append age range to the list
            age_range.append(age)
            age_range = "-".join(age_range)
    # if something unexpected happens, then return nan
    except:
         return np.nan
    # return the age range list
    return age_range
# create a new column of age ranges
philippines['age_range'] = philippines['specifications'].apply(extract_age_range)

# extract family name from philippines data

In [165]:
# extract family name from name column
def extract_family_name(value):
    # always have a try clause in case something unexpected happens
    try:
        # check some conditions before entering the block
        if value.split(' ')[-1] != '' and value.split(' ')[-1].isdigit() != True and len(value.split(' ')[-1]) > 4 and '\n' not in value.split(' ')[-1] \
        and '(' not in value.split(' ')[-1]:
            # return the last string 
            return value.split(' ')[-1]
        # check some other conditions before entering the block
        elif value.split(' ')[-2].isdigit() != True and len(value.split(' ')[-2]) > 4 and '\n' not in value.split(' ')[-1] \
        and '(' not in value.split(' ')[-2]:
            # return the last string 
            return value.split(' ')[-2]
        # if neither one of the conditions is met, then return nan
        else:
            return np.nan
    # if something unexpected happens, then return nan
    except:
        return np.nan
# create a column for the family name which we extracted from the name column
philippines['family_name'] = philippines['name'].apply(extract_family_name)

In [166]:
# print the head of the dataframe
philippines.head(2)

,name,visa_number,id,address,phone_number,specifications,office,condition,city,neighbor,...,good_with_kids,good_with_elderly,muslim,not_muslim,religion_not_specified,marrid,not_marrid,status_not_specified,age_range,family_name
0,مسعود مقيت محمد الشبوي,1104381620,1013904816,الرياض - حي السويدي - شارع اسحق بن عبدالرحمن -...,NaN,جديدة/ عمر(30-38)/ مهم مسلمة - تجيد معاملة الأ...,PH,تم الوصول,الرياض,حي السويدي,...,True,False,True,False,False,False,False,True,30-38,الشبوي
1,مسعد سرحان عبدالله الخالدي,1104373638,1033166263,الرياض-حي الياسمين - شارع الفرعة - منزل 9/ب / ...,NaN,خبيرة- عمر (30-40) - معاملة أطفال (3),PH,تم الوصول,الرياض,حي الياسمين,...,True,False,False,False,True,False,False,True,30-40,الخالدي

In [167]:
# check the shape of the data
philippines.shape

(222, 24)

In [168]:
# drop the original columns
philippines.drop(['name', 'address', 'specifications', 'condition', 'phone_number', 'neighbor'], axis=1, inplace=True)

In [169]:
# drop rows if all columns are null
philippines.dropna(how='all', inplace=True)

In [170]:
# check the shape of the data after dropping null rows
philippines.shape

(222, 18)

In [171]:
# print the final version of our data
philippines.head()

,visa_number,id,office,city,appearance,have_wokred,no_experience,experience_not_specified,good_with_kids,good_with_elderly,muslim,not_muslim,religion_not_specified,marrid,not_marrid,status_not_specified,age_range,family_name
0,1104381620,1013904816,PH,الرياض,False,False,True,False,True,False,True,False,False,False,False,True,30-38,الشبوي
1,1104373638,1033166263,PH,الرياض,False,False,False,True,True,False,False,False,True,False,False,True,30-40,الخالدي
2,5200101517,1025375773,PH,الجنوب,False,False,False,True,False,True,False,False,True,False,False,True,35-40,اليامي
3,1104218534,1110896246,PH,الرياض,False,False,True,False,True,False,False,False,True,False,False,True,30-35,العتيبي
4,3100050964,1023827015,PH,تبوك,False,False,False,True,False,False,False,False,True,False,False,True,NaN,الشمراني

In [172]:
# check the null values
philippines.isnull().sum()

visa_number                  0
id                           0
office                      18
city                         6
appearance                   0
have_wokred                  0
no_experience                0
experience_not_specified     0
good_with_kids               0
good_with_elderly            0
muslim                       0
not_muslim                   0
religion_not_specified       0
marrid                       0
not_marrid                   0
status_not_specified         0
age_range                   36
family_name                 43
dtype: int64

### - The first part of preprocessing in the philippines data is done. Now we'll make sure that we replace any dirty value with the the value other values.

In [173]:
# philippines.office.isnull().sum()
# I replace the null values with the most frequent office 'class'
philippines.office.fillna('office_not_specified', inplace=True)

In [174]:
# make a mask: 1st: for city that occurs less than 6 times.
mask_city_less_than_five = philippines.city.value_counts()[philippines.city.value_counts() < 6]

# apply our mask
philippines.city = philippines.city.apply(lambda x: 'city_not_specified' if x in mask_city_less_than_five else x)

# check the value counts after our final cleaning
philippines.city.value_counts()

الرياض                115
city_not_specified     64
ابها                   14
تبوك                   13
الطائف                 10
Name: city, dtype: int64

In [175]:
# make a mask: 1st: for age range that occurs less than 6 times.
mask_age_range_less_than_five = philippines.age_range.value_counts()[philippines.age_range.value_counts() < 5]

# apply our mask
philippines.age_range = philippines.age_range.apply(lambda x: 'age_not_specified' if x in mask_age_range_less_than_five else x)

# check the value counts after our final cleaning
philippines.age_range.value_counts()

30-40                46
25-35                45
age_not_specified    35
25-30                17
35-40                16
30-35                12
35-45                 5
25-37                 5
30-38                 5
Name: age_range, dtype: int64

In [176]:
# make a mask: 1st: for family name that occurs less than 4 times.
mask_family_name_less_than_five = philippines.family_name.value_counts()[philippines.family_name.value_counts() < 4]

# apply our mask
philippines.family_name = philippines.family_name.apply(lambda x: 'family_not_specified' if x in mask_family_name_less_than_five else x)

# check the value counts after our final cleaning
philippines.family_name.value_counts()

family_not_specified    78
العتيبي                 17
القحطاني                12
العنزي                   9
الشهراني                 8
الشهري                   7
الدوسري                  7
المطيري                  6
العصيمي                  6
العمري                   5
الزهراني                 4
السبيعي                  4
البلوي                   4
الرويلي                  4
البقمي                   4
الحربي                   4
Name: family_name, dtype: int64

In [177]:
# finally we have no null values
philippines.isnull().sum()

visa_number                  0
id                           0
office                       0
city                         6
appearance                   0
have_wokred                  0
no_experience                0
experience_not_specified     0
good_with_kids               0
good_with_elderly            0
muslim                       0
not_muslim                   0
religion_not_specified       0
marrid                       0
not_marrid                   0
status_not_specified         0
age_range                   36
family_name                 43
dtype: int64

In [178]:
# deal with null values and replace them with most the frequent class
philippines.loc[philippines.age_range.isnull(),"age_range"] = 'age_not_specified'
philippines.loc[philippines.family_name.isnull(),"family_name"] = 'family_not_specified'

In [179]:
# finally we have no null values
philippines.isnull().sum()

visa_number                 0
id                          0
office                      0
city                        6
appearance                  0
have_wokred                 0
no_experience               0
experience_not_specified    0
good_with_kids              0
good_with_elderly           0
muslim                      0
not_muslim                  0
religion_not_specified      0
marrid                      0
not_marrid                  0
status_not_specified        0
age_range                   0
family_name                 0
dtype: int64

### - Now we'll print the dataframe after done preproccesing

In [180]:
# print the head of the dataframe
philippines.head()

,visa_number,id,office,city,appearance,have_wokred,no_experience,experience_not_specified,good_with_kids,good_with_elderly,muslim,not_muslim,religion_not_specified,marrid,not_marrid,status_not_specified,age_range,family_name
0,1104381620,1013904816,PH,الرياض,False,False,True,False,True,False,True,False,False,False,False,True,30-38,family_not_specified
1,1104373638,1033166263,PH,الرياض,False,False,False,True,True,False,False,False,True,False,False,True,30-40,family_not_specified
2,5200101517,1025375773,PH,city_not_specified,False,False,False,True,False,True,False,False,True,False,False,True,35-40,family_not_specified
3,1104218534,1110896246,PH,الرياض,False,False,True,False,True,False,False,False,True,False,False,True,30-35,العتيبي
4,3100050964,1023827015,PH,تبوك,False,False,False,True,False,False,False,False,True,False,False,True,age_not_specified,family_not_specified

# 3) cleaning sri_lanka data

In [181]:
# print the head of the data
sri_lanka.head(3)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,متابعة معاملات دولة سريلانكا,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [182]:
# drop the first three rows since that they have no values
sri_lanka.drop(sri_lanka.index[:3], inplace=True)

In [183]:
# set the first row to be our columns names
sri_lanka.rename(columns=sri_lanka.iloc[0], inplace=True)

In [184]:
# drop the first row which is a duplicate of our columns names
sri_lanka.drop(sri_lanka.index[:1], inplace=True)

In [185]:
# reassign the data after droping some unuseful columns
sri_lanka = sri_lanka.iloc[:, 2:-5]

In [186]:
# reset index
sri_lanka.reset_index(inplace=True, drop=True)

In [187]:
# since mostl rows at the end are null, I am going to reassign the dataframe with the none_null values one
sri_lanka = sri_lanka.iloc[:440]

In [188]:
# rename columns
columns_translated = {'الاسم': 'name', 'رقم التأشيره': 'visa_number', 'رقم السجل': 'id', 'تاريخ الميلاد': 'date_of_birth',
                   'العنوان - رقم الهاتف': 'address_phone_number', 'المواصفات': 'specifications', 'تاريخ التقديم': 'date_of_submission',
                   'المكتب': 'office', 'الحالة': 'condition', 'تاريخ الوصول': 'arrival_date', 'ملاحظات': 'note'
                  }

In [189]:
# translate the columns from Arabic to English
sri_lanka.rename(columns=columns_translated, inplace=True)

In [190]:
# check the column names
sri_lanka.columns

Index(['name', 'visa_number', 'id', 'date_of_birth', 'address_phone_number',
       'specifications', 'date_of_submission', 'office', 'condition',
       'arrival_date', 'note'],
      dtype='object')

In [191]:
# check the null values per column
sri_lanka.isnull().sum()

name                      0
visa_number               2
id                        2
date_of_birth           273
address_phone_number     35
specifications           59
date_of_submission       65
office                   72
condition                 8
arrival_date            253
note                     41
dtype: int64

In [192]:
# drop columns when null values are a lot
sri_lanka.drop(columns=['date_of_birth', 'date_of_submission', 'arrival_date', 'note'], inplace=True)

In [193]:
# print the data after dropping unuseful columns
sri_lanka.head(2)

,name,visa_number,id,address_phone_number,specifications,office,condition
0,فيصل صلال العصيمي,1104288734,1045706197,الرياض - 0505456478,جديدة - غير مسلمة \nالعمر30-35,Y,تم الوصول
1,عبدالله صلال العصيمي,1104235110,1000547560,الرياض,جديدة,NaN,تم الوصول

# extract phone number from sri_lanka data

In [194]:
# get the digit out of the address_phone_number column
sri_lanka_phone_number = sri_lanka.address_phone_number.str.findall(r'\d+')

# create a new column of phone number extracted from address and phone number column
sri_lanka['phone_number'] = sri_lanka_phone_number.apply(extract_phone_number)

# extract city from sri_lanka data

In [195]:
# extract city from the address_phone_number column

# create a new column of the city out from the address_phone_number column
sri_lanka['city'] = sri_lanka['address_phone_number'].apply(extract_city)

### **NOTE: There is no neighbor provided for this dataset

# Use Python vectorization technique to extract some features

In [196]:
# extract appearance with True and False values. True if the client specified appearance in the request form    
sri_lanka['appearance'] = sri_lanka.specifications.str.contains('حسنة المظهر', 'مقبولة الشكل').astype(bool)

# extract experience with True and False values. True if the client specified that the maid has experience in the request form    
sri_lanka['have_wokred'] = sri_lanka.specifications.str.contains('سبق لها').astype(bool)

# extract experience with True and False values. True if the client specified that the maid has no experience in the request form    
sri_lanka['no_experience'] = sri_lanka.specifications.str.contains('جديدة', 'يسبق').astype(bool)

# extract experience with True and False values. True if the client did not specified that the maid has nor does not have experience in the request form    
sri_lanka['experience_not_specified'] = (~sri_lanka['no_experience']) & (~sri_lanka['have_wokred'])

# extract good with kids with True and False values. True if the client did not specified that the maid is okay with dealing with kids in the request form    
sri_lanka['good_with_kids'] = sri_lanka.specifications.str.contains('أطفال').astype(bool)

# extract good with elderly with True and False values. True if the client did not specified that the maid is okay with dealing with elderly in the request form
sri_lanka['good_with_elderly'] = sri_lanka.specifications.str.contains('رعاية', 'السن').astype(bool)


# making two masks with True and False values.
# in the first mask, we specified that we want the value to be True if the word muslim is in the cell
mask_muslim = sri_lanka.specifications.apply(lambda x: word_in_col("مسلم", x))

# in the second mask, we specified that we want the value to be True if the word not-muslim is in the cell
mask_not_muslim = sri_lanka.specifications.apply(lambda x: word_in_col("غير مسلم", x))

# create a column named muslim if the mask is True when we specified that muslim return True
sri_lanka['muslim'] = (mask_muslim & ~mask_not_muslim)

# create a column named not_muslim if the mask is True when we specified that not-muslim return True
sri_lanka['not_muslim'] =  mask_not_muslim

# create a column named religion not specified if the mask is not True when we did not specified that religion
sri_lanka['religion_not_specified'] =  ~mask_muslim 

# making two masks with True and False values.
# in the first mask, we specified that we want the value to be True if the word marrid is in the cell
mask_marrid = sri_lanka.specifications.apply(lambda x: word_in_col("متزوج", x))

# in the second mask, we specified that we want the value to be True if the word marrid is in the cell
mask_not_marrid = sri_lanka.specifications.apply(lambda x: word_in_col("غير متزوج", x))

# create a column named marrid if the mask is True when we specified that marrid return True
sri_lanka['marrid'] = (mask_marrid & ~mask_not_marrid)

# create a column named not_marrid if the mask is True when we specified that not-marrid return True
sri_lanka['not_marrid'] =  mask_not_marrid

# create a column named status not specified if the mask is not True when we did not specified that status
sri_lanka['status_not_specified'] =  ~mask_marrid

In [197]:
# extract age range from the specifications column

# create a new column named age_range
sri_lanka['age_range'] = sri_lanka['specifications'].apply(extract_age_range)

In [198]:
# extract family name from name column
# make a new column named faimly name where we extracted last name from the column name
sri_lanka['family_name'] = sri_lanka['name'].apply(extract_family_name)

In [199]:
sri_lanka.head(2)

,name,visa_number,id,address_phone_number,specifications,office,condition,phone_number,city,appearance,...,good_with_kids,good_with_elderly,muslim,not_muslim,religion_not_specified,marrid,not_marrid,status_not_specified,age_range,family_name
0,فيصل صلال العصيمي,1104288734,1045706197,الرياض - 0505456478,جديدة - غير مسلمة \nالعمر30-35,Y,تم الوصول,0505456478,الرياض,False,...,False,False,False,True,False,False,False,True,30-35,العصيمي
1,عبدالله صلال العصيمي,1104235110,1000547560,الرياض,جديدة,NaN,تم الوصول,NaN,الرياض,False,...,False,False,False,False,True,False,False,True,NaN,العصيمي

In [200]:
# check the shape of the data
sri_lanka.shape

(440, 23)

In [201]:
sri_lanka.isnull().sum()

name                          0
visa_number                   2
id                            2
address_phone_number         35
specifications               59
office                       72
condition                     8
phone_number                121
city                         48
appearance                    0
have_wokred                   0
no_experience                 0
experience_not_specified      0
good_with_kids                0
good_with_elderly             0
muslim                        0
not_muslim                    0
religion_not_specified        0
marrid                        0
not_marrid                    0
status_not_specified          0
age_range                   113
family_name                  85
dtype: int64

In [202]:
# drop the original columns
sri_lanka.drop(['name', 'address_phone_number', 'specifications', 'condition', 'phone_number'], axis=1, inplace=True)

In [203]:
# drop rows if all columns are null
sri_lanka.dropna(how='all', inplace=True)

In [204]:
# check the shape of the data after dropping null rows
sri_lanka.shape

(440, 18)

In [205]:
# print the final version of our data
sri_lanka.head()

,visa_number,id,office,city,appearance,have_wokred,no_experience,experience_not_specified,good_with_kids,good_with_elderly,muslim,not_muslim,religion_not_specified,marrid,not_marrid,status_not_specified,age_range,family_name
0,1104288734,1045706197,Y,الرياض,False,False,True,False,False,False,False,True,False,False,False,True,30-35,العصيمي
1,1104235110,1000547560,NaN,الرياض,False,False,True,False,False,False,False,False,True,False,False,True,NaN,العصيمي
2,1104307271,1007875352,NaN,الرياض,False,False,True,False,False,False,False,False,True,False,False,True,25-35,الحربي
3,1104062658,1000624708,NaN,الرياض,False,True,False,False,False,False,False,False,True,False,False,True,NaN,العتيبي
4,1104268516,1013037559,Y,الرياض,False,True,False,False,False,False,False,True,False,False,False,True,30-40,الرويس

In [206]:
# check the null values
sri_lanka.isnull().sum()

visa_number                   2
id                            2
office                       72
city                         48
appearance                    0
have_wokred                   0
no_experience                 0
experience_not_specified      0
good_with_kids                0
good_with_elderly             0
muslim                        0
not_muslim                    0
religion_not_specified        0
marrid                        0
not_marrid                    0
status_not_specified          0
age_range                   113
family_name                  85
dtype: int64

### - The first part of preprocessing in the philippines data is done. Now we'll make sure that we replace any dirty value with the the value other values.

In [207]:
# sri_lanka.visa_number.isnull().sum()
sri_lanka.visa_number.fillna(0, inplace=True)

In [208]:
# sri_lanka.id.isnull().sum()
sri_lanka.id.fillna(0, inplace=True)

In [209]:
# sri_lanka.office.isnull().sum()
sri_lanka.office.fillna('office_not_specified', inplace=True)

In [210]:
# make a mask: 1st: for city that occurs less than 6 times.
mask_city_less_than_six = sri_lanka.city.value_counts()[sri_lanka.city.value_counts() < 6]

# apply our mask
sri_lanka.city = sri_lanka.city.apply(lambda x: 'city_not_specified' if (x in mask_city_less_than_six or x == 'أبو') else x)

# check the value counts after our final cleaning
sri_lanka.city.value_counts()

الرياض                240
city_not_specified     87
القصيم                 17
وادي                   13
الدمام                 11
حائل                    9
ابها                    9
الطائف                  6
Name: city, dtype: int64

In [211]:
# deal with unfamiliar family name
sri_lanka.loc[sri_lanka.city == 'وادي',"city"] = 'وادي الدواسر'
sri_lanka.loc[sri_lanka.city.isnull(),"city"] = 'city_not_specified'

In [212]:
# make a mask: 1st: for age range that occurs less than 6 times.
mask_age_range_less_than_six = sri_lanka.age_range.value_counts()[sri_lanka.age_range.value_counts() < 6]

# apply our mask
sri_lanka.age_range = sri_lanka.age_range.apply(lambda x: 'age_not_specified' if x in mask_age_range_less_than_six else x)

# check the value counts after our final cleaning
sri_lanka.age_range.value_counts()

30-40                89
25-35                71
30-35                46
age_not_specified    42
35-40                21
25-40                15
30-38                14
35-45                14
25-30                 9
25-38                 6
Name: age_range, dtype: int64

In [213]:
# make a mask: 1st: for family name that occurs less than 5 times.
mask_family_name_less_than_five = sri_lanka.family_name.value_counts()[sri_lanka.family_name.value_counts() < 5]

# apply our mask
sri_lanka.family_name = sri_lanka.family_name.apply(lambda x: 'family_not_specified' if x in mask_family_name_less_than_five else x)

# check the value counts after our final cleaning
sri_lanka.family_name.value_counts()

family_not_specified    189
العتيبي                  37
العنزي                   26
المطيري                  23
الدوسري                  16
القحطاني                 14
الحربي                    8
السلمي                    7
الشهراني                  7
السبيعي                   7
الشمري                    6
الغبيشي                   5
الشهري                    5
العصيمي                   5
Name: family_name, dtype: int64

In [214]:
# finally we have no null values
sri_lanka.isnull().sum()

visa_number                   0
id                            0
office                        0
city                          0
appearance                    0
have_wokred                   0
no_experience                 0
experience_not_specified      0
good_with_kids                0
good_with_elderly             0
muslim                        0
not_muslim                    0
religion_not_specified        0
marrid                        0
not_marrid                    0
status_not_specified          0
age_range                   113
family_name                  85
dtype: int64

In [215]:
# deal with null values and replace them with most the frequent class
sri_lanka.loc[sri_lanka.age_range.isnull(),"age_range"] = 'age_not_specified'
sri_lanka.loc[sri_lanka.family_name.isnull(),"family_name"] = 'family_not_specified'

In [216]:
# finally we have no null values
sri_lanka.isnull().sum()

visa_number                 0
id                          0
office                      0
city                        0
appearance                  0
have_wokred                 0
no_experience               0
experience_not_specified    0
good_with_kids              0
good_with_elderly           0
muslim                      0
not_muslim                  0
religion_not_specified      0
marrid                      0
not_marrid                  0
status_not_specified        0
age_range                   0
family_name                 0
dtype: int64

In [217]:
sri_lanka.head()

,visa_number,id,office,city,appearance,have_wokred,no_experience,experience_not_specified,good_with_kids,good_with_elderly,muslim,not_muslim,religion_not_specified,marrid,not_marrid,status_not_specified,age_range,family_name
0,1104288734,1045706197,Y,الرياض,False,False,True,False,False,False,False,True,False,False,False,True,30-35,العصيمي
1,1104235110,1000547560,office_not_specified,الرياض,False,False,True,False,False,False,False,False,True,False,False,True,age_not_specified,العصيمي
2,1104307271,1007875352,office_not_specified,الرياض,False,False,True,False,False,False,False,False,True,False,False,True,25-35,الحربي
3,1104062658,1000624708,office_not_specified,الرياض,False,True,False,False,False,False,False,False,True,False,False,True,age_not_specified,العتيبي
4,1104268516,1013037559,Y,الرياض,False,True,False,False,False,False,False,True,False,False,False,True,30-40,family_not_specified

### we're done preprocessing the data and cleaning it. 
    Now we'll create another column in each one which will contain the country name, so that we can concat the three of them afterwords

In [218]:
# creating a column for the country in all three dataframes
bangladesh['country'] = 'Bangladesh'
philippines['country'] = 'Philippines'
sri_lanka['country'] = 'Srilanka'
bangladesh.shape, philippines.shape, sri_lanka.shape
# sri_lanka is -1 because this dataframe doesn't contain a neighbor info

((678, 19), (222, 19), (440, 19))

In [219]:
# create a new dataframe which contain all three dataframes
bps_df = pd.concat([bangladesh, philippines, sri_lanka])

In [220]:
bps_df.head()

,visa_number,id,office,city,appearance,have_wokred,no_experience,experience_not_specified,good_with_kids,good_with_elderly,muslim,not_muslim,religion_not_specified,marrid,not_marrid,status_not_specified,age_range,family_name,country
0,1800025194,1054846645,D,الرياض,False,False,False,True,False,False,False,False,True,False,False,True,25-35,family_not_specified,Bangladesh
1,1104303794,1034719789,D,الرياض,False,False,False,True,False,False,False,False,True,False,False,True,25-35,الشمري,Bangladesh
2,1104304960,1002211058,D,الرياض,False,False,False,True,False,False,False,False,True,False,False,True,25-35,العتيبي,Bangladesh
3,1104298913,1016030874,A,الرياض,False,False,False,True,False,False,False,False,True,False,False,True,25-35,القحطاني,Bangladesh
4,3100056928,1016030833,D,الرياض,False,False,False,True,False,False,False,False,True,False,False,True,25-35,القحطاني,Bangladesh

In [221]:
# check how many classes to we have in the new dataframe
bps_df.country.value_counts()

Bangladesh     678
Srilanka       440
Philippines    222
Name: country, dtype: int64

In [222]:
# the shape of our final dataframe
bps_df.shape

(1340, 19)

In [223]:
bps_df.columns

Index(['visa_number', 'id', 'office', 'city', 'appearance', 'have_wokred',
       'no_experience', 'experience_not_specified', 'good_with_kids',
       'good_with_elderly', 'muslim', 'not_muslim', 'religion_not_specified',
       'marrid', 'not_marrid', 'status_not_specified', 'age_range',
       'family_name', 'country'],
      dtype='object')

In [224]:
# check if we have null values in the final dataframe
bps_df.isnull().sum()

visa_number                 0
id                          0
office                      0
city                        6
appearance                  0
have_wokred                 0
no_experience               0
experience_not_specified    0
good_with_kids              0
good_with_elderly           0
muslim                      0
not_muslim                  0
religion_not_specified      0
marrid                      0
not_marrid                  0
status_not_specified        0
age_range                   0
family_name                 0
country                     0
dtype: int64

#### it seems that we have a small bug in the dataframe, now we'll deal with it!

In [225]:
# make a mask: 1st: for city that occurs less than 10 times.
mask_city_less_than_ten = bps_df.city.value_counts()[bps_df.city.value_counts() < 10]

# apply our mask
bps_df.city = bps_df.city.apply(lambda x: 'city_not_specified' if (x in mask_city_less_than_ten or x == 'أبو') else x)

# check the value counts after our final cleaning
bps_df.city.value_counts()

الرياض                745
city_not_specified    365
ابها                   40
القصيم                 39
الدمام                 31
تبوك                   27
الطائف                 23
بيشه                   20
وادي الدواسر           13
حائل                   11
جدة                    10
المدينه                10
Name: city, dtype: int64

In [226]:
# deal with null values and replace them with most the frequent class
bps_df.loc[bps_df.city.isnull(),"city"] = 'city_not_specified'

In [227]:
# check the null values after we're done cleaning
bps_df.isnull().sum()

visa_number                 0
id                          0
office                      0
city                        0
appearance                  0
have_wokred                 0
no_experience               0
experience_not_specified    0
good_with_kids              0
good_with_elderly           0
muslim                      0
not_muslim                  0
religion_not_specified      0
marrid                      0
not_marrid                  0
status_not_specified        0
age_range                   0
family_name                 0
country                     0
dtype: int64

In [228]:
# clean the visa column since we do have one inconsistent value
def clean_visa(value):
    try:
        return value.split("\n")[0]
    except:
        return value
# reassign the visa number with the new value after cleaning
bps_df.visa_number = bps_df.visa_number.apply(clean_visa)

In [229]:
# print the dataframe column
bps_df.columns

Index(['visa_number', 'id', 'office', 'city', 'appearance', 'have_wokred',
       'no_experience', 'experience_not_specified', 'good_with_kids',
       'good_with_elderly', 'muslim', 'not_muslim', 'religion_not_specified',
       'marrid', 'not_marrid', 'status_not_specified', 'age_range',
       'family_name', 'country'],
      dtype='object')

In [230]:
# check the data types of our dataframe
bps_df.dtypes

visa_number                 object
id                          object
office                      object
city                        object
appearance                    bool
have_wokred                   bool
no_experience                 bool
experience_not_specified      bool
good_with_kids                bool
good_with_elderly             bool
muslim                        bool
not_muslim                    bool
religion_not_specified        bool
marrid                        bool
not_marrid                    bool
status_not_specified          bool
age_range                   object
family_name                 object
country                     object
dtype: object

### Finally, we'll write the clean version of the data into a csv file. so that we can deal with it in a new file

In [231]:
# write the data into a csv file
bps_df.to_csv('clean_data_version_of_the_dirty_one.csv')